# RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize Property
ParameterTypeId Class See Also
---
"Analytical Grid Cell Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace